rails/app/controllers/v1/stories_controller.rb

SELECT "stories".* FROM "stories"  ORDER BY "stories"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
---
    def index
      @stories = Story.includes(:user).order(created_at: "desc").all

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      @story = Story.find(params[:id])

INSERT INTO "stories" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Switch Off"], ["body", "this is my article blahblahblahblahblah"], ["user_id", 1], ["created_at", "2015-04-06 17:08:44.982908"], ["updated_at", "2015-04-06 17:08:44.982908"]]
---
    def create
      @story = Story.new(story_params)

      if @story.save