app/controllers/v1/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "authentication_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
      @user = User.new(user_params)

      if @user.save